Revit 2027 API
DirectShapeType.CanChangeFamilyName Method
 Checks whether the DirectShapeType supports a custom family name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanChangeFamilyName()
Public Function CanChangeFamilyName As Boolean
public:
bool CanChangeFamilyName()
member CanChangeFamilyName : unit -> bool
Return Value
Boolean
 True if a custom family name is supported, false otherwise.
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace